tutorials/combustion/fireFoam/les/oppositeBurningPanels/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    };

    "(rho)Final"
    {
        $rho;
        relTol          0;
    }

    p_rgh
    {
        solver              GAMG;
        tolerance           1e-5;
        relTol              0.01;
        smoother            GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    };

    p_rghFinal
    {
        solver              GAMG;
        tolerance           1e-6;
        relTol              0;
        smoother            GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };


    "(U|k)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
    };

    "(U|k)Final"
    {
        $U;
        relTol          0;
    };


    "(hs|hsFinal|Yi)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    };

    Ii
    {
        solver              GAMG;
        tolerance           1e-4;
        relTol              0;
        smoother            DILU;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    G
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  2;
    nCorrectors       1;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        "(U|k).*"                   1;
        "(C3H8|O2|H2O|CO2|hs).*"    1;
    }
}

// ************************************************************************* //
